ESRGgroup9/slipad/code/ext/third_party/notUsed/STM32_SX1278_433MHz/STM32_SX1278 433MHz Receiver/Source/Drivers/RFsx1276.c
    SX1276LoRaSetDefaults( );
    
    SX1276ReadBuffer( REG_LR_OPMODE, SX1276Regs + 1, 0x70 - 1 );
    
    SX1276LR->RegLna = RFLR_LNA_GAIN_G1;

    SX1276WriteBuffer( REG_LR_OPMODE, SX1276Regs + 1, 0x70 - 1 );
	  //debug
    SX1276ReadBuffer( REG_LR_OPMODE, SX1276Regs + 1, 0x70 - 1 );
	
    // set the RF settings 
    SX1276LoRaSetRFFrequency( LoRaSettings.RFFrequency );
    SX1276LoRaSetSpreadingFactor( LoRaSettings.SpreadingFactor ); // SF6 only operates in implicit header mode.
    SX1276LoRaSetErrorCoding( LoRaSettings.ErrorCoding );
    SX1276LoRaSetPacketCrcOn( LoRaSettings.CrcOn );
    SX1276LoRaSetSignalBandwidth( LoRaSettings.SignalBw );

    SX1276LoRaSetImplicitHeaderOn( LoRaSettings.ImplicitHeaderOn );
    SX1276LoRaSetSymbTimeout( 0x3FF );
    SX1276LoRaSetPayloadLength( LoRaSettings.PayloadLength );
    SX1276LoRaSetLowDatarateOptimize( true );
		//debug
    SX1276ReadBuffer( REG_LR_OPMODE, SX1276Regs + 1, 0x70 - 1 );
		
#if( ( MODULE_SX1276RF1IAS == 1 ) || ( MODULE_SX1276RF1KAS == 1 ) )
    if( LoRaSettings.RFFrequency > 860000000 )
    {
        SX1276LoRaSetPAOutput( RFLR_PACONFIG_PASELECT_RFO );
        SX1276LoRaSetPa20dBm( false );
        LoRaSettings.Power = 14;
        SX1276LoRaSetRFPower( LoRaSettings.Power );
    }
    else
    {
        SX1276LoRaSetPAOutput( RFLR_PACONFIG_PASELECT_PABOOST );
        SX1276LoRaSetPa20dBm( true );
        LoRaSettings.Power = 20;
        SX1276LoRaSetRFPower( LoRaSettings.Power );
    } 
#elif( MODULE_SX1276RF1JAS == 1 )
    if( LoRaSettings.RFFrequency > 860000000 )
    {
        SX1276LoRaSetPAOutput( RFLR_PACONFIG_PASELECT_PABOOST );
        SX1276LoRaSetPa20dBm( true );
        LoRaSettings.Power = 20;
        SX1276LoRaSetRFPower( LoRaSettings.Power );
    }
    else
    {
        SX1276LoRaSetPAOutput( RFLR_PACONFIG_PASELECT_RFO );
        SX1276LoRaSetPa20dBm( false );
        LoRaSettings.Power = 14;
        SX1276LoRaSetRFPower( LoRaSettings.Power );
    } 
#endif

    SX1276LoRaSetOpMode( RFLR_OPMODE_STANDBY );
}

void SX1276Init( void )
{
    // Initialize FSK and LoRa registers structure
    SX1276 = ( tSX1276* )SX1276Regs;
    SX1276LR = ( tSX1276LR* )SX1276Regs;
    SX1276InitIo( );
    SX1276Reset( );
    // REMARK: After radio reset the default modem is 
    LoRaOn = true;
    SX1276SetLoRaOn( LoRaOn );
    SX1276LoRaInit( );
}
void SX1276LoRaSetRFState( uint8_t state )
{
    RFLRState = state;
}
uint8_t SX1276LoRaReadRxGain( void )
{
    SX1276Read( REG_LR_LNA, &SX1276LR->RegLna );
    return( SX1276LR->RegLna >> 5 ) & 0x07;
}

void SX1276StartRx( void )
{
  SX1276LoRaSetRFState( RFLR_STATE_RX_INIT );
}

void SX1276LoRaGetRxPacket( void *buffer, uint16_t *size )
{
    *size = RxPacketSize;
    RxPacketSize = 0;
    memcpy( ( void * )buffer, ( void * )RFBuffer, ( size_t )*size );
}

void SX1276GetRxPacket( void *buffer, uint16_t *size )
{
   SX1276LoRaGetRxPacket( buffer, size );
}
void SX1276LoRaSetTxPacket( const void *buffer, uint16_t size )
{
    if( LoRaSettings.FreqHopOn == false )
    {
        TxPacketSize = size;
    }
    else
    {
        TxPacketSize = 255;
    }
    memcpy( ( void * )RFBuffer, buffer, ( size_t )TxPacketSize ); 

    RFLRState = RFLR_STATE_TX_INIT;
}
void SX1276SetTxPacket( const void *buffer, uint16_t size )
{
  SX1276LoRaSetTxPacket( buffer, size );
}
uint8_t SX1276FskReadRxGain( void )
{
    SX1276Read( REG_LNA, &SX1276->RegLna );
    return( SX1276->RegLna >> 5 ) & 0x07;
}

void SX1276_Rx_Count_Time(void)
{
	SysTick->CTRL&=~SysTick_CTRL_ENABLE_Msk;  
	SysTick->LOAD=(u32)9000*(LoRaSettings.RxPacketTimeout);
	SysTick->VAL =0x00;    
  SysTick->CTRL|=SysTick_CTRL_ENABLE_Msk ;
}

void SX1276_Tx_Count_Time(void)   
{
	SysTick->CTRL&=~SysTick_CTRL_ENABLE_Msk;  
	SysTick->LOAD=(u32)9000*(LoRaSettings.TxPacketTimeout);
	SysTick->VAL =0x00;        
  SysTick->CTRL|=SysTick_CTRL_ENABLE_Msk ;
}
uint32_t SX1276LoRaProcess1( void )
{
    uint32_t result = RF_BUSY;
    
    switch( RFLRState )
			{
				case RFLR_STATE_IDLE:
				break;
				case RFLR_STATE_RX_INIT:  
								SX1276LoRaSetOpMode( RFLR_OPMODE_STANDBY );
								SX1276LR->RegIrqFlagsMask = RFLR_IRQFLAGS_RXTIMEOUT |RFLR_IRQFLAGS_VALIDHEADER |RFLR_IRQFLAGS_TXDONE |RFLR_IRQFLAGS_CADDONE |RFLR_IRQFLAGS_CADDETECTED;
								SX1276Write( REG_LR_IRQFLAGSMASK, SX1276LR->RegIrqFlagsMask );
								if( LoRaSettings.FreqHopOn == true )
										{
												SX1276LR->RegHopPeriod = LoRaSettings.HopPeriod;
												SX1276Read( REG_LR_HOPCHANNEL, &SX1276LR->RegHopChannel );
												SX1276LoRaSetRFFrequency( HoppingFrequencies[SX1276LR->RegHopChannel & RFLR_HOPCHANNEL_CHANNEL_MASK] );
										}
								else
										{
												SX1276LR->RegHopPeriod = 255;
										}
								SX1276Write( REG_LR_HOPPERIOD, SX1276LR->RegHopPeriod );		
								SX1276LoRaSetOpMode( RFLR_OPMODE_RECEIVER_SINGLE );
								memset( RFBuffer, 0, ( size_t )RF_BUFFER_SIZE );
								SX1276_Rx_Count_Time();
								RFLRState = RFLR_STATE_RX_RUNNING;
				break;
				case RFLR_STATE_RX_RUNNING:
								SX1276Read(REG_LR_IRQFLAGS,&TxRxFlag );
								if((TxRxFlag&0x40)==0x40)
										{	
											TxRxFlag=0X00;								
											if( LoRaSettings.FreqHopOn == true )
													{
															SX1276Read( REG_LR_HOPCHANNEL, &SX1276LR->RegHopChannel );
															SX1276LoRaSetRFFrequency( HoppingFrequencies[SX1276LR->RegHopChannel & RFLR_HOPCHANNEL_CHANNEL_MASK] );
													}
											SX1276Write( REG_LR_IRQFLAGS, RFLR_IRQFLAGS_RXDONE  );					
											RFLRState = RFLR_STATE_RX_DONE;
										}
								if((TxRxFlag&0x02)==0x02)
										{ 
											TxRxFlag=0X00;
											if( LoRaSettings.FreqHopOn == true )
													{
															SX1276Read( REG_LR_HOPCHANNEL, &SX1276LR->RegHopChannel );
															SX1276LoRaSetRFFrequency( HoppingFrequencies[SX1276LR->RegHopChannel & RFLR_HOPCHANNEL_CHANNEL_MASK] );
													}
											SX1276Write( REG_LR_IRQFLAGS, RFLR_IRQFLAGS_FHSSCHANGEDCHANNEL );// Clear Irq
										}
								else
										{
											TxRxFlag=0X00;
											RxTimeoutTimer=SysTick->CTRL;
											if((RxTimeoutTimer&0x01&&!(RxTimeoutTimer&(1<<16)))==0)
													{
														SysTick->CTRL&=~SysTick_CTRL_ENABLE_Msk;
														SysTick->VAL =0X00;                     
														RFLRState = RFLR_STATE_RX_TIMEOUT;
													}
										}
				break;
				case RFLR_STATE_RX_DONE:
								SX1276Read( REG_LR_IRQFLAGS, &SX1276LR->RegIrqFlags );
								if( ( SX1276LR->RegIrqFlags & RFLR_IRQFLAGS_PAYLOADCRCERROR ) == RFLR_IRQFLAGS_PAYLOADCRCERROR )
											{
													SX1276Write( REG_LR_IRQFLAGS, RFLR_IRQFLAGS_PAYLOADCRCERROR  );
													RFLRState = RFLR_STATE_RX_INIT;
												  break;
											}
								
								{
										uint8_t rxSnrEstimate;
										SX1276Read( REG_LR_PKTSNRVALUE, &rxSnrEstimate );
										if( rxSnrEstimate & 0x80 ) 
												{
														RxPacketSnrEstimate = ( ( ~rxSnrEstimate + 1 ) & 0xFF ) >> 2;
														RxPacketSnrEstimate = -RxPacketSnrEstimate;
												}
										else
												{
														RxPacketSnrEstimate = ( rxSnrEstimate & 0xFF ) >> 2;
												}
								}
								
