ESRGgroup9/slipad/code/ext/third_party/notUsed/STM32_SX1278_433MHz/STM32_SX1278 433MHz Receiver/Source/Drivers/RFsx1276.c
									// Initializes the payload size
									SX1276LR->RegPayloadLength = TxPacketSize;
									SX1276Write( REG_LR_PAYLOADLENGTH, SX1276LR->RegPayloadLength );
									
									SX1276LR->RegFifoTxBaseAddr = 0x00; // Full buffer used for Tx
									SX1276Write( REG_LR_FIFOTXBASEADDR, SX1276LR->RegFifoTxBaseAddr );

									SX1276LR->RegFifoAddrPtr = SX1276LR->RegFifoTxBaseAddr;
									SX1276Write( REG_LR_FIFOADDRPTR, SX1276LR->RegFifoAddrPtr );
									
									// Write payload buffer to LORA modem
									SX1276WriteFifo( RFBuffer, SX1276LR->RegPayloadLength );
																									// TxDone               RxTimeout                   FhssChangeChannel          ValidHeader         
									SX1276LR->RegDioMapping1 = RFLR_DIOMAPPING1_DIO0_01 | RFLR_DIOMAPPING1_DIO1_00 | RFLR_DIOMAPPING1_DIO2_00 | RFLR_DIOMAPPING1_DIO3_01;
																									// PllLock              Mode Ready
									SX1276LR->RegDioMapping2 = RFLR_DIOMAPPING2_DIO4_01 | RFLR_DIOMAPPING2_DIO5_00;
									SX1276WriteBuffer( REG_LR_DIOMAPPING1, &SX1276LR->RegDioMapping1, 2 );

									SX1276LoRaSetOpMode( RFLR_OPMODE_TRANSMITTER );
									 
									RFLRState = RFLR_STATE_TX_RUNNING;
					break;
					case RFLR_STATE_TX_RUNNING:
									if( DIO0 == 1 ) 
											{
													SX1276Write( REG_LR_IRQFLAGS, RFLR_IRQFLAGS_TXDONE  );// Clear Irq
													RFLRState = RFLR_STATE_TX_DONE;   
											}
									if( DIO2 == 1 ) 
											{
													if( LoRaSettings.FreqHopOn == true )
														{
																SX1276Read( REG_LR_HOPCHANNEL, &SX1276LR->RegHopChannel );
																SX1276LoRaSetRFFrequency( HoppingFrequencies[SX1276LR->RegHopChannel & RFLR_HOPCHANNEL_CHANNEL_MASK] );
														}
													SX1276Write( REG_LR_IRQFLAGS, RFLR_IRQFLAGS_FHSSCHANGEDCHANNEL );
											}
					break;
					case RFLR_STATE_TX_DONE:
									SX1276LoRaSetOpMode( RFLR_OPMODE_STANDBY );
									RFLRState = RFLR_STATE_RX_INIT;
									result = RF_TX_DONE;
					break;
			} 
    return result;
}
uint32_t SX1276LoRaProcess( void )
{
    uint32_t result = RF_BUSY;
    
    switch( RFLRState )
			{
				case RFLR_STATE_IDLE:
				break;
				case RFLR_STATE_RX_INIT:        
								SX1276LoRaSetOpMode( RFLR_OPMODE_STANDBY );
								SX1276LR->RegIrqFlagsMask = RFLR_IRQFLAGS_RXTIMEOUT |RFLR_IRQFLAGS_VALIDHEADER |RFLR_IRQFLAGS_TXDONE |RFLR_IRQFLAGS_CADDONE |RFLR_IRQFLAGS_CADDETECTED;
								SX1276Write( REG_LR_IRQFLAGSMASK, SX1276LR->RegIrqFlagsMask );
								if( LoRaSettings.FreqHopOn == true )
									{
											SX1276LR->RegHopPeriod = LoRaSettings.HopPeriod;
											SX1276Read( REG_LR_HOPCHANNEL, &SX1276LR->RegHopChannel );
											SX1276LoRaSetRFFrequency( HoppingFrequencies[SX1276LR->RegHopChannel & RFLR_HOPCHANNEL_CHANNEL_MASK] );
									}
								else
									{
											SX1276LR->RegHopPeriod = 255;
									}
								SX1276Write( REG_LR_HOPPERIOD, SX1276LR->RegHopPeriod );	
								SX1276LR->RegDioMapping1 = RFLR_DIOMAPPING1_DIO0_00 | RFLR_DIOMAPPING1_DIO1_00 | RFLR_DIOMAPPING1_DIO2_00 | RFLR_DIOMAPPING1_DIO3_00;// RxDone                    RxTimeout                   FhssChangeChannel           CadDone																		
								SX1276LR->RegDioMapping2 = RFLR_DIOMAPPING2_DIO4_00 | RFLR_DIOMAPPING2_DIO5_00;// CadDetected               ModeReady
								SX1276WriteBuffer( REG_LR_DIOMAPPING1, &SX1276LR->RegDioMapping1, 2 );
								SX1276LoRaSetOpMode( RFLR_OPMODE_RECEIVER_SINGLE );
								memset( RFBuffer, 0, ( size_t )RF_BUFFER_SIZE );
								SX1276_Rx_Count_Time();
								RFLRState = RFLR_STATE_RX_RUNNING;
				break;
				case RFLR_STATE_RX_RUNNING:
								if( DIO0 == 1 ) 
										{
											if( LoRaSettings.FreqHopOn == true )
													{
															SX1276Read( REG_LR_HOPCHANNEL, &SX1276LR->RegHopChannel );
															SX1276LoRaSetRFFrequency( HoppingFrequencies[SX1276LR->RegHopChannel & RFLR_HOPCHANNEL_CHANNEL_MASK] );
													}
												SX1276Write( REG_LR_IRQFLAGS, RFLR_IRQFLAGS_RXDONE );// Clear Irq
												RFLRState = RFLR_STATE_RX_DONE;
										}
								if( DIO2 == 1 ) 
										{
											if( LoRaSettings.FreqHopOn == true )
													{
															SX1276Read( REG_LR_HOPCHANNEL, &SX1276LR->RegHopChannel );
															SX1276LoRaSetRFFrequency( HoppingFrequencies[SX1276LR->RegHopChannel & RFLR_HOPCHANNEL_CHANNEL_MASK] );
													}
												SX1276Write( REG_LR_IRQFLAGS, RFLR_IRQFLAGS_FHSSCHANGEDCHANNEL );
										}
								else
										{
											RxTimeoutTimer=SysTick->CTRL;
											if((RxTimeoutTimer&0x01&&!(RxTimeoutTimer&(1<<16)))==0)
													{
														SysTick->CTRL&=~SysTick_CTRL_ENABLE_Msk;
														SysTick->VAL =0X00;                     
														RFLRState = RFLR_STATE_RX_TIMEOUT;
													}
										}
				break;
				case RFLR_STATE_RX_DONE:
								SX1276Read( REG_LR_IRQFLAGS, &SX1276LR->RegIrqFlags );
								if( ( SX1276LR->RegIrqFlags & RFLR_IRQFLAGS_PAYLOADCRCERROR ) == RFLR_IRQFLAGS_PAYLOADCRCERROR )
										{		
												SX1276Write( REG_LR_IRQFLAGS, RFLR_IRQFLAGS_PAYLOADCRCERROR  );// Clear Irq
												RFLRState = RFLR_STATE_RX_INIT;
											  break;
										}
						
								{
										uint8_t rxSnrEstimate;
										SX1276Read( REG_LR_PKTSNRVALUE, &rxSnrEstimate );
										if( rxSnrEstimate & 0x80 ) // The SNR sign bit is 1
											{
													RxPacketSnrEstimate = ( ( ~rxSnrEstimate + 1 ) & 0xFF ) >> 2;// Invert and divide by 4
													RxPacketSnrEstimate = -RxPacketSnrEstimate;
											}
										else
											{
													RxPacketSnrEstimate = ( rxSnrEstimate & 0xFF ) >> 2;// Divide by 4
											}
								}
						
								if( LoRaSettings.RFFrequency < 860000000 )  // LF
									{    
										if( RxPacketSnrEstimate < 0 )
											{
													RxPacketRssiValue = NOISE_ABSOLUTE_ZERO + 10.0 * SignalBwLog[LoRaSettings.SignalBw] + NOISE_FIGURE_LF + ( double )RxPacketSnrEstimate;
											}
										else
											{    
													SX1276Read( REG_LR_PKTRSSIVALUE, &SX1276LR->RegPktRssiValue );
													RxPacketRssiValue = RssiOffsetLF[LoRaSettings.SignalBw] + ( double )SX1276LR->RegPktRssiValue;
											}
									}
								else                                        // HF
									{    
										if( RxPacketSnrEstimate < 0 )
											{
													RxPacketRssiValue = NOISE_ABSOLUTE_ZERO + 10.0 * SignalBwLog[LoRaSettings.SignalBw] + NOISE_FIGURE_HF + ( double )RxPacketSnrEstimate;
											}
										else
											{    
													SX1276Read( REG_LR_PKTRSSIVALUE, &SX1276LR->RegPktRssiValue );
													RxPacketRssiValue = RssiOffsetHF[LoRaSettings.SignalBw] + ( double )SX1276LR->RegPktRssiValue;
											}
									}

								SX1276LR->RegFifoAddrPtr = SX1276LR->RegFifoRxBaseAddr;
								SX1276Write( REG_LR_FIFOADDRPTR, SX1276LR->RegFifoAddrPtr );
								if( LoRaSettings.ImplicitHeaderOn == true )
									{
											RxPacketSize = SX1276LR->RegPayloadLength;
											SX1276ReadFifo( RFBuffer, SX1276LR->RegPayloadLength );
									}
								else
									{
											SX1276Read( REG_LR_NBRXBYTES, &SX1276LR->RegNbRxBytes );
											RxPacketSize = SX1276LR->RegNbRxBytes;
											SX1276ReadFifo( RFBuffer, SX1276LR->RegNbRxBytes );
									}	
								SysTick->CTRL&=~SysTick_CTRL_ENABLE_Msk; 
								SysTick->VAL =0X00;                      							
								RFLRState = RFLR_STATE_RX_INIT;
								result = RF_RX_DONE;
				break;
				case RFLR_STATE_RX_TIMEOUT:
								RFLRState = RFLR_STATE_RX_INIT;
								result = RF_RX_TIMEOUT;
				break;
				case RFLR_STATE_TX_INIT:
								SX1276LoRaSetOpMode( RFLR_OPMODE_STANDBY );
								if( LoRaSettings.FreqHopOn == true )
									{
											SX1276LR->RegIrqFlagsMask = RFLR_IRQFLAGS_RXTIMEOUT |RFLR_IRQFLAGS_RXDONE |RFLR_IRQFLAGS_PAYLOADCRCERROR |RFLR_IRQFLAGS_VALIDHEADER |RFLR_IRQFLAGS_CADDONE |RFLR_IRQFLAGS_CADDETECTED;
											SX1276LR->RegHopPeriod = LoRaSettings.HopPeriod;
											SX1276Read( REG_LR_HOPCHANNEL, &SX1276LR->RegHopChannel );
											SX1276LoRaSetRFFrequency( HoppingFrequencies[SX1276LR->RegHopChannel & RFLR_HOPCHANNEL_CHANNEL_MASK] );
									}
								else
									{
											SX1276LR->RegIrqFlagsMask = RFLR_IRQFLAGS_RXTIMEOUT |RFLR_IRQFLAGS_RXDONE |RFLR_IRQFLAGS_PAYLOADCRCERROR |RFLR_IRQFLAGS_VALIDHEADER |RFLR_IRQFLAGS_CADDONE |RFLR_IRQFLAGS_FHSSCHANGEDCHANNEL |RFLR_IRQFLAGS_CADDETECTED;
											SX1276LR->RegHopPeriod = 0;
									}
								SX1276Write( REG_LR_HOPPERIOD, SX1276LR->RegHopPeriod );
								SX1276Write( REG_LR_IRQFLAGSMASK, SX1276LR->RegIrqFlagsMask );
								SX1276LR->RegPayloadLength = TxPacketSize;// Initializes the payload size
								SX1276Write( REG_LR_PAYLOADLENGTH, SX1276LR->RegPayloadLength );
								SX1276LR->RegFifoTxBaseAddr = 0x00; // Full buffer used for Tx
								SX1276Write( REG_LR_FIFOTXBASEADDR, SX1276LR->RegFifoTxBaseAddr );
								SX1276LR->RegFifoAddrPtr = SX1276LR->RegFifoTxBaseAddr;
								SX1276Write( REG_LR_FIFOADDRPTR, SX1276LR->RegFifoAddrPtr );
								SX1276WriteFifo( RFBuffer, SX1276LR->RegPayloadLength );// Write payload buffer to LORA modem																					
								SX1276LR->RegDioMapping1 = RFLR_DIOMAPPING1_DIO0_01 | RFLR_DIOMAPPING1_DIO1_00 | RFLR_DIOMAPPING1_DIO2_00 | RFLR_DIOMAPPING1_DIO3_01;// TxDone               RxTimeout                   FhssChangeChannel          ValidHeader         
								SX1276LR->RegDioMapping2 = RFLR_DIOMAPPING2_DIO4_01 | RFLR_DIOMAPPING2_DIO5_00;// PllLock              Mode Ready
								SX1276WriteBuffer( REG_LR_DIOMAPPING1, &SX1276LR->RegDioMapping1, 2 );
								SX1276LoRaSetOpMode( RFLR_OPMODE_TRANSMITTER );	
								SX1276_Rx_Count_Time();//2015.07.09修改							
								RFLRState = RFLR_STATE_TX_RUNNING;
				break;
				case RFLR_STATE_TX_RUNNING:
								if( DIO0 == 1 ) // TxDone
										{
												SX1276Write( REG_LR_IRQFLAGS, RFLR_IRQFLAGS_TXDONE  );// Clear Irq
												RFLRState = RFLR_STATE_TX_DONE;   
										}
								if( DIO2 == 1 ) // FHSS Changed Channel
										{
												if( LoRaSettings.FreqHopOn == true )
													{
															SX1276Read( REG_LR_HOPCHANNEL, &SX1276LR->RegHopChannel );
															SX1276LoRaSetRFFrequency( HoppingFrequencies[SX1276LR->RegHopChannel & RFLR_HOPCHANNEL_CHANNEL_MASK] );
													}
												SX1276Write( REG_LR_IRQFLAGS, RFLR_IRQFLAGS_FHSSCHANGEDCHANNEL );// Clear Irq
										}
								else
										{
											TxTimeoutTimer=SysTick->CTRL;
											if((TxTimeoutTimer&0x01&&!(TxTimeoutTimer&(1<<16)))==0)
													{
														SysTick->CTRL&=~SysTick_CTRL_ENABLE_Msk;
														SysTick->VAL =0X00;                     
														RFLRState = RFLR_STATE_TX_TIMEOUT;
													}
										}
				break;
				case RFLR_STATE_TX_DONE:
								SX1276LoRaSetOpMode( RFLR_OPMODE_STANDBY );
								SysTick->CTRL&=~SysTick_CTRL_ENABLE_Msk; 
								SysTick->VAL =0X00;                      
								RFLRState = RFLR_STATE_RX_INIT;
								result = RF_TX_DONE;
				break;
				case RFLR_STATE_TX_TIMEOUT:
					      SX1276LoRaSetOpMode( RFLR_OPMODE_STANDBY );
								RFLRState = RFLR_STATE_RX_INIT;
								result = RF_TX_TIMEOUT;
				break;
			} 
    return result;
}
uint32_t SX1276Process( void )
{
  return SX1276LoRaProcess( );
}

void RF_Sx1276_Init(void)
{
 //Spi_Init();
 SX1276Init();
 SX1276SetIdleState();
}
void A(void)
{
	if(RxGain ==2)
	if(RFState==3)
	if(RxPacketRssiValue==4){}
}
